<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.lambda_functions.data.archive_file.populate_coffee_pool: Reading...
module.lambda_functions.data.archive_file.daily_coffee: Reading...
module.lambda_functions.data.archive_file.daily_coffee: Read complete after 0s [id=bce823137b1bd5ebb42370a3957ec481144644eb]
module.lambda_functions.data.archive_file.populate_coffee_pool: Read complete after 0s [id=230e7f2d094c856a5a11752253c2cec5f002caac]
module.lambda_functions.aws_iam_policy.cloudwatch_logs: Refreshing state... [id=arn:aws:iam::057149530255:policy/terraform_cloudwatch_logs_policy-dev]
module.lambda_functions.aws_iam_role.populate_coffee_pool: Refreshing state... [id=lambda_populate_coffee_pool_role-dev]
module.lambda_functions.aws_iam_policy.daily_coffee: Refreshing state... [id=arn:aws:iam::057149530255:policy/terraform_lambda_daily_coffee-dev]
module.lambda_functions.aws_iam_policy.batchwrite_coffee_pool: Refreshing state... [id=arn:aws:iam::057149530255:policy/terraform_dynamodb_batchwrite_policy-dev]
module.lambda_functions.aws_iam_role.daily_coffee: Refreshing state... [id=lambda_daily_coffee_role-dev]
module.dynamodb_tables.aws_dynamodb_table.coffee_pool: Refreshing state... [id=coffee_pool-dev]
module.dynamodb_tables.aws_dynamodb_table.tier_list: Refreshing state... [id=tier_list-dev]
module.lambda_functions.aws_iam_role_policy_attachment.populate_coffee_pool_batchwrite_coffee_pool: Refreshing state... [id=lambda_populate_coffee_pool_role-dev-20231113184635588900000003]
module.lambda_functions.aws_iam_role_policy_attachment.populate_coffee_pool_cloudwatch_logs: Refreshing state... [id=lambda_populate_coffee_pool_role-dev-20231113184635579200000002]
module.lambda_functions.aws_iam_role_policy_attachment.daily_coffee_policy: Refreshing state... [id=lambda_daily_coffee_role-dev-20231115195101112400000001]
module.lambda_functions.aws_iam_role_policy_attachment.daily_coffee_cloudwatch_logs: Refreshing state... [id=lambda_daily_coffee_role-dev-20231113184635539100000001]
module.lambda_functions.aws_lambda_function.populate_coffee_pool: Refreshing state... [id=populate_coffee_pool-dev]
module.lambda_functions.aws_lambda_function.daily_coffee: Refreshing state... [id=daily_coffee-dev]
module.api_app.aws_api_gateway_method.daily_coffee: Refreshing state... [id=agm-jfrfryrkn3-undac0-GET]
module.api_app.aws_api_gateway_integration.daily_coffee: Refreshing state... [id=agi-jfrfryrkn3-undac0-GET]
module.api_app.aws_api_gateway_rest_api.this: Refreshing state... [id=jfrfryrkn3]
module.api_app.aws_api_gateway_api_key.this: Refreshing state... [id=ga9l41p0v9]
module.api_app.aws_api_gateway_resource.root: Refreshing state... [id=sogf0r]
module.api_app.aws_api_gateway_resource.daily_coffee: Refreshing state... [id=undac0]
module.api_app.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api_app.aws_api_gateway_deployment.this: Refreshing state... [id=skyh3v]
module.api_app.aws_api_gateway_stage.this: Refreshing state... [id=ags-jfrfryrkn3-dev]
module.api_app.aws_api_gateway_usage_plan.this: Refreshing state... [id=42vl6e]
module.api_app.aws_api_gateway_usage_plan_key.this: Refreshing state... [id=ga9l41p0v9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.api_app.aws_api_gateway_integration.daily_coffee will be destroyed
  # (because aws_api_gateway_integration.daily_coffee is not in configuration)
  - resource "aws_api_gateway_integration" "daily_coffee" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "undac0" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-jfrfryrkn3-undac0-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "undac0" -> null
      - rest_api_id             = "jfrfryrkn3" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:eu-south-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-south-2:057149530255:function:daily_coffee-dev/invocations" -> null
    }

  # module.api_app.aws_api_gateway_integration.get_daily_coffee will be created
  + resource "aws_api_gateway_integration" "get_daily_coffee" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "undac0"
      + rest_api_id             = "jfrfryrkn3"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:eu-south-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-south-2:057149530255:function:daily_coffee-dev/invocations"
    }

  # module.api_app.aws_api_gateway_integration.opt_daily_coffee will be created
  + resource "aws_api_gateway_integration" "opt_daily_coffee" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id          = "undac0"
      + rest_api_id          = "jfrfryrkn3"
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.api_app.aws_api_gateway_integration_response.opt_daily_coffee will be created
  + resource "aws_api_gateway_integration_response" "opt_daily_coffee" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = "undac0"
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token,X-Amz-User-Agent'"
          + "method.response.header.Access-Control-Allow-Methods" = "'DELETE,GET,HEAD,OPTIONS,PATCH,POST,PUT'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = "jfrfryrkn3"
      + status_code         = "200"
    }

  # module.api_app.aws_api_gateway_method.daily_coffee will be destroyed
  # (because aws_api_gateway_method.daily_coffee is not in configuration)
  - resource "aws_api_gateway_method" "daily_coffee" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "GET" -> null
      - id                   = "agm-jfrfryrkn3-undac0-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "undac0" -> null
      - rest_api_id          = "jfrfryrkn3" -> null
    }

  # module.api_app.aws_api_gateway_method.get_daily_coffee will be created
  + resource "aws_api_gateway_method" "get_daily_coffee" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = "undac0"
      + rest_api_id      = "jfrfryrkn3"
    }

  # module.api_app.aws_api_gateway_method.opt_daily_coffee will be created
  + resource "aws_api_gateway_method" "opt_daily_coffee" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + resource_id      = "undac0"
      + rest_api_id      = "jfrfryrkn3"
    }

  # module.api_app.aws_api_gateway_method_response.opt_daily_coffee will be created
  + resource "aws_api_gateway_method_response" "opt_daily_coffee" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = "undac0"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = "jfrfryrkn3"
      + status_code         = "200"
    }

Plan: 6 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @erikmichel-dev, Action: `pull_request`